#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.prod.data.archive_file.http_function_source["java"]: Reading...
module.prod.data.archive_file.http_function_source["go"]: Reading...
module.prod.data.archive_file.http_function_source["http"]: Reading...
module.prod.data.archive_file.http_function_source["video"]: Reading...
module.prod.data.archive_file.http_function_source["java"]: Read complete after 0s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
module.prod.data.archive_file.http_function_source["hello"]: Reading...
module.prod.data.archive_file.http_function_source["warn"]: Reading...
module.prod.data.archive_file.http_function_source["exam"]: Reading...
module.prod.data.archive_file.pubsub_function_source["stm"]: Reading...
module.prod.data.archive_file.http_function_source["go"]: Read complete after 0s [id=2b43ceea3bef18a296541bf1613fd465c8d8fa04]
module.prod.data.archive_file.pubsub_function_source["stm"]: Read complete after 0s [id=1872f700d426106da7416fbf11d78490db2e8667]
module.prod.data.archive_file.http_function_source["js"]: Reading...
module.prod.data.archive_file.http_function_source["video"]: Read complete after 0s [id=f596deb8463554d5744679eeb2214e4569389e90]
module.prod.data.archive_file.http_function_source["warn"]: Read complete after 0s [id=bb50471fc4fcc30b3afd4d35789b65cd210d1bf8]
module.prod.data.archive_file.http_function_source["http"]: Read complete after 1s [id=0066e75efc17eee22bdfb4a3e99230e6edcd1c5a]
module.prod.data.archive_file.http_function_source["exam"]: Read complete after 1s [id=1957a226e9873495eb39cafd88cc906d3ef06c3b]
module.prod.data.archive_file.http_function_source["js"]: Read complete after 1s [id=358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7]
module.prod.data.archive_file.http_function_source["describe"]: Reading...
module.prod.data.archive_file.http_function_source["merch"]: Reading...
module.prod.data.archive_file.http_function_source["hello"]: Read complete after 1s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
module.prod.data.archive_file.http_function_source["ban"]: Reading...
module.prod.data.archive_file.http_function_source["gif"]: Reading...
module.prod.data.archive_file.http_function_source["answer"]: Reading...
module.prod.data.archive_file.http_function_source["listwarn"]: Reading...
module.prod.data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
module.prod.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
module.prod.data.archive_file.http_function_source["leaderboard"]: Reading...
module.prod.data.archive_file.http_function_source["merch"]: Read complete after 0s [id=df6f67767fcc0a096ae3706ad16d46535b3c7411]
module.prod.data.archive_file.http_function_source["level"]: Reading...
module.prod.data.archive_file.http_function_source["answer"]: Read complete after 0s [id=8990ff7d100ccf1a9eefa60e2fed3d07432d19e1]
module.prod.data.archive_file.http_function_source["ban"]: Read complete after 0s [id=f18ae3714f39a133deaf558ead8a924d5fe6c229]
module.prod.data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=d276adec74a5ac23773986b167399557ae58f455]
module.prod.data.archive_file.http_function_source["help"]: Reading...
module.prod.data.archive_file.http_function_source["gif"]: Read complete after 0s [id=531b9967286445e03ddd548761fd5ab6011a40b8]
module.prod.data.archive_file.http_function_source["froge"]: Reading...
module.prod.data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=252109fa737667a04b37534623605057a5f685fd]
module.prod.data.archive_file.pubsub_function_source["exp"]: Reading...
module.prod.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
module.prod.data.archive_file.http_function_source["level"]: Read complete after 0s [id=3fcc615182fd8bdcd4ab92bb62515ef6b58a0ea6]
module.prod.data.archive_file.http_function_source["help"]: Read complete after 0s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
module.prod.data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
module.prod.data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
module.prod.data.archive_file.http_function_source["froge"]: Read complete after 0s [id=98990a9f59ec6a8711e7f90924fb0ce1e4b483ad]
module.prod.data.archive_file.pubsub_function_source["channelMessage"]: Reading...
module.prod.data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=93ff48c45ffeafd96931e0b86e287b1336eeeeda]
module.prod.data.archive_file.pubsub_function_source["privateMessage"]: Reading...
module.prod.data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=58b5c4fc08e673f9a0495eaf05ce6e8aaf3bad90]
module.prod.data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=11ee72eeff88c7124659eee1f86ee4cf38b54f5b]
module.prod.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=42cf7b777fbde137b3785a8a36a0eafac217948b]
module.prod.data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09]
module.prod.data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=5305b29788056190ec120eeaca643defb7281d46]
module.prod.google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function-prod]
module.prod.google_secret_manager_secret.secret-basic["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
module.prod.google_secret_manager_secret.secret-basic["YOUTUBE_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN]
module.prod.google_cloud_scheduler_job.stm_status_scheduler[0]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/jobs/stm_status]
module.prod.google_cloud_scheduler_job.froge_of_the_day_scheduler[0]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/jobs/froge_of_the_day]
module.prod.google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_channel_message_discord]
module.prod.google_logging_project_sink.cloud_function_sink: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-error-prod]
module.prod.google_storage_bucket.froge: Refreshing state... [id=froge-public-bucket-prod]
module.prod.google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
module.prod.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 1s [id=4913bcafb4583b2af1c6c5c0fe869f133821bac8]
module.prod.google_secret_manager_secret.secret-basic["STM_API_KEY"]: Refreshing state... [id=projects/archy-f06ed/secrets/STM_API_KEY]
module.prod.google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
module.prod.google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_froge_of_the_day]
module.prod.google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_cloud_function_error_log]
module.prod.google_pubsub_topic.pubsub_topic["stm_status"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_stm_status]
module.prod.google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_generate_welcome_image]
module.prod.google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_exp_discord]
module.prod.google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_private_message_discord]
module.prod.google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_update_user_role]
module.prod.google_storage_bucket_access_control.public_rule: Refreshing state... [id=froge-public-bucket-prod/allUsers]
module.prod.google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-prod-src-4913bcafb4583b2af1c6c5c0fe869f133821bac8.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-prod-src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-prod-src-11ee72eeff88c7124659eee1f86ee4cf38b54f5b.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-prod-src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-prod-src-42cf7b777fbde137b3785a8a36a0eafac217948b.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["stm"]: Refreshing state... [id=archy-f06ed-function-prod-src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-prod-src-58b5c4fc08e673f9a0495eaf05ce6e8aaf3bad90.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-prod-src-5305b29788056190ec120eeaca643defb7281d46.zip]
module.prod.google_storage_bucket_object.http_function_zip["hello"]: Refreshing state... [id=archy-f06ed-function-prod-src-d3aff51c68f98c729867e28f35be543c27184d8e.zip]
module.prod.google_storage_bucket_object.http_function_zip["leaderboard"]: Refreshing state... [id=archy-f06ed-function-prod-src-d276adec74a5ac23773986b167399557ae58f455.zip]
module.prod.google_storage_bucket_object.http_function_zip["describe"]: Refreshing state... [id=archy-f06ed-function-prod-src-8149d3888af4d77844b83253c94a05cff143ff3f.zip]
module.prod.google_storage_bucket_object.http_function_zip["gif"]: Refreshing state... [id=archy-f06ed-function-prod-src-531b9967286445e03ddd548761fd5ab6011a40b8.zip]
module.prod.google_storage_bucket_object.http_function_zip["help"]: Refreshing state... [id=archy-f06ed-function-prod-src-e4f9818109e6d3c6fb840ab00b90c99a6637c51a.zip]
module.prod.google_storage_bucket_object.http_function_zip["warn"]: Refreshing state... [id=archy-f06ed-function-prod-src-bb50471fc4fcc30b3afd4d35789b65cd210d1bf8.zip]
module.prod.google_storage_bucket_object.http_function_zip["ban"]: Refreshing state... [id=archy-f06ed-function-prod-src-f18ae3714f39a133deaf558ead8a924d5fe6c229.zip]
module.prod.google_storage_bucket_object.http_function_zip["answer"]: Refreshing state... [id=archy-f06ed-function-prod-src-8990ff7d100ccf1a9eefa60e2fed3d07432d19e1.zip]
module.prod.google_storage_bucket_object.http_function_zip["froge"]: Refreshing state... [id=archy-f06ed-function-prod-src-98990a9f59ec6a8711e7f90924fb0ce1e4b483ad.zip]
module.prod.google_storage_bucket_object.http_function_zip["java"]: Refreshing state... [id=archy-f06ed-function-prod-src-5c394ffff4f20dea8bc47029905259fa732a6a85.zip]
module.prod.google_storage_bucket_object.http_function_zip["js"]: Refreshing state... [id=archy-f06ed-function-prod-src-358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7.zip]
module.prod.google_storage_bucket_object.http_function_zip["listwarn"]: Refreshing state... [id=archy-f06ed-function-prod-src-252109fa737667a04b37534623605057a5f685fd.zip]
module.prod.google_storage_bucket_object.http_function_zip["merch"]: Refreshing state... [id=archy-f06ed-function-prod-src-df6f67767fcc0a096ae3706ad16d46535b3c7411.zip]
module.prod.google_storage_bucket_object.http_function_zip["video"]: Refreshing state... [id=archy-f06ed-function-prod-src-f596deb8463554d5744679eeb2214e4569389e90.zip]
module.prod.google_storage_bucket_object.http_function_zip["level"]: Refreshing state... [id=archy-f06ed-function-prod-src-3fcc615182fd8bdcd4ab92bb62515ef6b58a0ea6.zip]
module.prod.google_storage_bucket_object.http_function_zip["exam"]: Refreshing state... [id=archy-f06ed-function-prod-src-1957a226e9873495eb39cafd88cc906d3ef06c3b.zip]
module.prod.google_storage_bucket_object.http_function_zip["go"]: Refreshing state... [id=archy-f06ed-function-prod-src-2b43ceea3bef18a296541bf1613fd465c8d8fa04.zip]
module.prod.google_storage_bucket_object.http_function_zip["http"]: Refreshing state... [id=archy-f06ed-function-prod-src-0066e75efc17eee22bdfb4a3e99230e6edcd1c5a.zip]
module.prod.google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_updateUserRole]
module.prod.google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_cloudErrorLog]
module.prod.google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_exp]
module.prod.google_cloudfunctions_function.pubsub_function["stm"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_stm]
module.prod.google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_channelMessage]
module.prod.google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_generateWelcomeImage]
module.prod.google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_privateMessage]
module.prod.google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_frogeOfTheDay]
module.prod.google_cloudfunctions_function.http_function["gif"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_gif]
module.prod.google_cloudfunctions_function.http_function["go"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_go]
module.prod.google_cloudfunctions_function.http_function["merch"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_merch]
module.prod.google_cloudfunctions_function.http_function["answer"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_answer]
module.prod.google_cloudfunctions_function.http_function["java"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_java]
module.prod.google_cloudfunctions_function.http_function["ban"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_ban]
module.prod.google_cloudfunctions_function.http_function["video"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_video]
module.prod.google_cloudfunctions_function.http_function["describe"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_describe]
module.prod.google_cloudfunctions_function.http_function["froge"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_froge]
module.prod.google_cloudfunctions_function.http_function["http"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_http]
module.prod.google_cloudfunctions_function.http_function["leaderboard"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_leaderboard]
module.prod.google_cloudfunctions_function.http_function["js"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_js]
module.prod.google_cloudfunctions_function.http_function["level"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_level]
module.prod.google_cloudfunctions_function.http_function["help"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_help]
module.prod.google_cloudfunctions_function.http_function["exam"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_exam]
module.prod.google_cloudfunctions_function.http_function["listwarn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_listwarn]
module.prod.google_cloudfunctions_function.http_function["warn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_warn]
module.prod.google_cloudfunctions_function.http_function["hello"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_hello]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.prod.google_storage_bucket_object.pubsub_function_zip["stm"] has changed
  ~ resource "google_storage_bucket_object" "pubsub_function_zip" {
        id               = "archy-f06ed-function-prod-src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip"
      + metadata         = {}
        name             = "src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip"
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.prod.google_cloudfunctions_function.pubsub_function["stm"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/prod_stm"
        name                  = "prod_stm"
      ~ source_archive_object = "src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip" -> "src-1872f700d426106da7416fbf11d78490db2e8667.zip"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.prod.google_storage_bucket_object.pubsub_function_zip["stm"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      ~ crc32c           = "44HXeQ==" -> (known after apply)
      ~ detect_md5hash   = "u+kAS2bOilOivKbnarvURQ==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-prod-src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "u+kAS2bOilOivKbnarvURQ==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-prod/o/src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip?generation=1675708818576461&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip" -> "src-1872f700d426106da7416fbf11d78490db2e8667.zip" # forces replacement
      ~ output_name      = "src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-prod/o/src-b3fc0f3d931e83597458f302ce209c3a18f34464.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @PierreOlivierBrillant, Action: `pull_request`, Working Directory: ``, Workflow: `Run terraform plan for production`*